// Найти или создать пользователя.
// 
// Параметры:
//  ПользовательИБ - ПользовательИнформационнойБазы
// 
// Возвращаемое значение:
//  СправочникСсылка.Пользователи - найденая или созданная ссылка
Функция НайтиИлиСоздатьПользователя(ПользовательИБ) Экспорт
	
	ПользоватльСсылка = НайтиПоНаименованию(ПользовательИБ.Имя);
	
	Если ПользоватльСсылка.Пустая() Тогда
		ПользовательОбъект = СоздатьЭлемент();
		ПользовательОбъект.Наименование = ПользовательИБ.Имя;
		ПользовательОбъект.ПолноеИмя = ПользовательИБ.ПолноеИмя;
		
		ПользовательОбъект.ЗаполнитьНаборПрав(ПользовательИБ);
		
		ПользовательОбъект.Записать();
		
		ПользоватльСсылка = ПользовательОбъект.Ссылка;
		
	КонецЕсли;
	
	Возврат ПользоватльСсылка;
	
КонецФункции