// Заполнить набор прав.
// 
// Параметры:
//  ПользовательИБ - ПользовательИнформационнойБазы - передается пользователь инф. базы
Процедура ЗаполнитьНаборПрав(ПользовательИБ) Экспорт
	
	РолиИБ = Метаданные.Роли;
	
	ЭтотОбъект.НаборПрав.Очистить();
	
	Для Каждого Роль Из РолиИБ Цикл
		
		СтрокаНабора = ЭтотОбъект.НаборПрав.Добавить();
		
		СтрокаНабора.ИмяРоли 			= Роль.Имя;
		СтрокаНабора.ПредставлениеРоли	= Роль.Синоним;
		СтрокаНабора.Активно			= ПользовательИБ.Роли.Содержит(Роль);
		
	КонецЦикла;
	
КонецПроцедуры



Процедура ПриЗаписи(Отказ)
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ЭтотОбъект.Наименование);
	
	Если ПользовательИБ = Неопределено Тогда
		
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		ПользовательИБ.Имя = Наименование;
		ПользовательИБ.ПолноеИмя = ПолноеИмя;
		
		НаборПравПользователя = ЭтотОбъект.НаборПрав.НайтиСтроки(Новый Структура("Активно", Истина));
		Для Каждого СтрокаНабораПрав Из НаборПравПользователя Цикл
			
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.Найти(СтрокаНабораПрав.ИмяРоли));
			
		КонецЦикла;
		
		ПользовательИБ.Записать();
		
	КонецЕсли;

КонецПроцедуры
